In [1]:
import os
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from datetime import date, timedelta
from pandas.tseries.offsets import * 
import calendar

pd.options.display.max_rows = 30
float_formatter = "฿{:,.2f}"

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"

today = date.today()
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 8, 25), datetime.date(2023, 8, 24))

In [2]:
#today = date(2023, 4, 25)
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 8, 25), datetime.date(2023, 8, 24))

In [3]:
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(1)
yesterday = today - num_business_days
print(f'today: {today}')
to_mmdd = today.strftime('%m-%d')
print(f'Today in mm-dd format: {to_mmdd}')
print(f'yesterday: {yesterday}')

today: 2023-08-25
Today in mm-dd format: 08-25
yesterday: 2023-08-24 00:00:00

In [4]:
#yesterday = yesterday.date()
yesterday

Timestamp('2023-08-24 00:00:00')

In [5]:
sql = '''
SELECT period, name, volbuy AS shares
FROM buy
ORDER BY period, name'''
buy = pd.read_sql(sql, const)
buy['shares'] = buy['shares'].astype('int64')
buy

   period     name  shares
0       1      MCS   78000
1       1    PTTGC    6000
2       1   SINGER    6000
3       1      STA    5000
4       2   AIMIRT   10000
5       2      ASP   30000
6       2  CPNREIT   60000
7       2      DIF   30000
8       2   GVREIT   42000
9       2    JASIF  130000
10      2      RCL   27000
11      2    SYNEX   15000
12      2    TFFIF   20000
13      2    WHAIR   50000
14      2    WHART   30000
15      3       AH    1200
16      3      ASK    4500
17      3      AWC    9000
18      3      JMT    4200
19      3      NER   27000
20      3      ORI   45000
21      4      BCH   15000
22      4      IVL    7200
23      4    JMART    6000
24      4      KCE   10000
25      4      PTG    3600
26      4      SCC     600
27      4     SENA  105000
28      4      TMT   36000

In [6]:
file_name = "buy-input.csv"
data_file = data_path + file_name
osd_file = osd_path + file_name
buy.to_csv(data_file, index=False)
buy.to_csv(osd_file, index=False)

In [7]:
sql = """
SELECT *
FROM price
LIMIT 1"""
prices = pd.read_sql(sql, const)
prices.dtypes

name      object
date      object
price    float64
maxp     float64
minp     float64
qty        int64
opnp     float64
dtype: object

### Call ruby ruby\find-change-fm-2-dates.rb

In [8]:
%pwd

'C:\\Users\\User\\OneDrive\\A7\\Daily'

In [9]:
os.chdir("C:\\users\\user\\onedrive\\a7")
%pwd

'C:\\users\\user\\onedrive\\a7'

In [10]:
!ruby ruby\\find-change-fm-2-dates.rb '2022-12-30' '2023-08-25'

    period       name     shares      date1      date2     price1     price2     change    %change     amount        spd
         1        MCS      78000   22-12-30   23-08-25       8.95       6.15      -2.80     -31.28 -218,400.00        -56
         1      PTTGC       6000   22-12-30   23-08-25      47.25      38.00      -9.25     -19.58 -55,500.00        -37
         1     SINGER       6000   22-12-30   23-08-25      28.75      11.30     -17.45     -60.70 -104,700.00       -152
         1        STA       5000   22-12-30   23-08-25      21.10      14.60      -6.50     -30.81 -32,500.00        -65
         2     AIMIRT      10000   22-12-30   23-08-25      12.10      11.00      -1.10      -9.09 -11,000.00        -11
         2        ASP      30000   22-12-30   23-08-25       2.98       3.00       0.02       0.67     600.00          1
         2    CPNREIT      60000   22-12-30   23-08-25      19.50      10.80      -8.70     -44.62 -522,000.00        -87
         2        DIF      30000   22-12-30   23-08-25      13.20       9.30      -3.90     -29.55 -117,000.00        -46
         2     GVREIT      42000   22-12-30   23-08-25       9.10       7.35      -1.75     -19.23 -73,500.00        -35
         2      JASIF     130000   22-12-30   23-08-25       8.05       6.95      -1.10     -13.66 -143,000.00        -22
         2        RCL      27000   22-12-30   23-08-25      30.75      21.60      -9.15     -29.76 -247,050.00        -57
         2      SYNEX      15000   22-12-30   23-08-25      16.40      13.20      -3.20     -19.51 -48,000.00        -32
         2      TFFIF      20000   22-12-30   23-08-25       7.65       7.45      -0.20      -2.61  -4,000.00         -4
         2      WHAIR      50000   22-12-30   23-08-25       7.45       6.95      -0.50      -6.71 -25,000.00        -10
         2      WHART      30000   22-12-30   23-08-25      10.70      10.40      -0.30      -2.80  -9,000.00         -3
         3         AH       1200   22-12-30   23-08-25      29.75      35.00       5.25      17.65   6,300.00         21
         3        ASK       4500   22-12-30   23-08-25      35.50      25.75      -9.75     -27.46 -43,875.00        -39
         3        AWC       9000   22-12-30   23-08-25       6.30       4.10      -2.20     -34.92 -19,800.00        -71
         3        JMT       4200   22-12-30   23-08-25      69.00      46.50     -22.50     -32.61 -94,500.00        -90
         3        NER      27000   22-12-30   23-08-25       6.35       4.64      -1.71     -26.93 -46,170.00        -45
         3        ORI      45000   22-12-30   23-08-25      12.10      10.80      -1.30     -10.74 -58,500.00        -13
         4        BCH      15000   22-12-30   23-08-25      20.50      19.40      -1.10      -5.37 -16,500.00        -11
         4        IVL       7200   22-12-30   23-08-25      40.75      29.50     -11.25     -27.61 -81,000.00        -45
         4      JMART       6000   22-12-30   23-08-25      40.75      22.30     -18.45     -45.28 -110,700.00        -90
         4        KCE      10000   22-12-30   23-08-25      46.50      50.00       3.50       7.53  35,000.00         14
         4        PTG       3600   22-12-30   23-08-25      14.50      10.60      -3.90     -26.90 -14,040.00        -39
         4        SCC        600   22-12-30   23-08-25     342.00     319.00     -23.00      -6.73 -13,800.00        -23
         4       SENA     105000   22-12-30   23-08-25       3.94       2.82      -1.12     -28.43 -117,600.00        -56
         4        TMT      36000   22-12-30   23-08-25       7.80       6.95      -0.85     -10.90 -30,600.00        -17

In [11]:
os.chdir("C:\\users\\user\\onedrive\\a7\\Daily")
%pwd

'C:\\users\\user\\onedrive\\a7\\Daily'

In [12]:
data_path = "../data/"
file_name   = 'prices-change.csv'
input_file = data_path + file_name
df = pd.read_csv(input_file, sep=',', index_col=None)
df.sample(5)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
26,4,SCC,600,2022-12-30,2023-08-25,342.00,319.00,-23.00,-6.73,-13800.0,-23
6,2,CPNREIT,60000,2022-12-30,2023-08-25,19.50,10.80,-8.70,-44.62,-522000.0,-87
23,4,JMART,6000,2022-12-30,2023-08-25,40.75,22.30,-18.45,-45.28,-110700.0,-90
9,2,JASIF,130000,2022-12-30,2023-08-25,8.05,6.95,-1.10,-13.66,-143000.0,-22
2,1,SINGER,6000,2022-12-30,2023-08-25,28.75,11.30,-17.45,-60.70,-104700.0,-152

In [13]:
df.sample(5).sort_values(['spd'],ascending=False)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
12,2,TFFIF,20000,2022-12-30,2023-08-25,7.65,7.45,-0.20,-2.61,-4000.0,-4
20,3,ORI,45000,2022-12-30,2023-08-25,12.10,10.80,-1.30,-10.74,-58500.0,-13
8,2,GVREIT,42000,2022-12-30,2023-08-25,9.10,7.35,-1.75,-19.23,-73500.0,-35
0,1,MCS,78000,2022-12-30,2023-08-25,8.95,6.15,-2.80,-31.28,-218400.0,-56
2,1,SINGER,6000,2022-12-30,2023-08-25,28.75,11.30,-17.45,-60.70,-104700.0,-152

In [14]:
df.sample(5).sort_values(['spd'],ascending=True)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
10,2,RCL,27000,2022-12-30,2023-08-25,30.75,21.60,-9.15,-29.76,-247050.0,-57
7,2,DIF,30000,2022-12-30,2023-08-25,13.20,9.30,-3.90,-29.55,-117000.0,-46
19,3,NER,27000,2022-12-30,2023-08-25,6.35,4.64,-1.71,-26.93,-46170.0,-45
16,3,ASK,4500,2022-12-30,2023-08-25,35.50,25.75,-9.75,-27.46,-43875.0,-39
9,2,JASIF,130000,2022-12-30,2023-08-25,8.05,6.95,-1.10,-13.66,-143000.0,-22

In [15]:
period = df.groupby("period")
period.sum()

        shares  price1  price2  change  %change     amount  spd
period
1        95000  106.05   70.05  -36.00  -142.37  -411100.0 -310
2       444000  137.88  108.00  -29.88  -176.87 -1198950.0 -306
3        90900  159.00  126.79  -32.21  -115.01  -256545.0 -237
4       183400  516.74  460.57  -56.17  -143.69  -349240.0 -267

In [16]:
df.groupby('period').agg(
      ttl_shr = pd.NamedAgg('shares', 'sum'),
      avr_p1  = pd.NamedAgg('price1','mean'),
      avr_p2  = pd.NamedAgg('price2','mean'),  
      avr_chg = pd.NamedAgg('change','mean'),
      avr_spd = pd.NamedAgg('spd','mean'),
      ttl_amt = pd.NamedAgg('amount', 'sum')
   )

        ttl_shr     avr_p1     avr_p2   avr_chg    avr_spd    ttl_amt
period
1         95000  26.512500  17.512500 -9.000000 -77.500000  -411100.0
2        444000  12.534545   9.818182 -2.716364 -27.818182 -1198950.0
3         90900  26.500000  21.131667 -5.368333 -39.500000  -256545.0
4        183400  64.592500  57.571250 -7.021250 -33.375000  -349240.0

In [17]:
pl = df.amount.sum()
float_formatter.format(pl)

'฿-2,215,835.00'

In [18]:
prev_pl = -2_286_255
diff = pl - prev_pl
float_formatter.format(diff)

'฿70,420.00'